package tests.registration.registrationMandatoryFields.hints;

public class Hints {
  public static final String[] STEP_1_HINTS = {
    "Необходимо заполнить «Фамилия».",
    "Необходимо заполнить «Имя».",
    "Необходимо заполнить «Дата рождения».",
    "Необходимо заполнить «Пол».",
    "Необходимо заполнить «Место рождения».",
    "Необходимо заполнить «Адрес регистрации».",
    "Необходимо заполнить «Индекс».",
    "Необходимо заполнить «СНИЛС»."
  };

  public static final String[] STEP_2_HINTS = {
    "Необходимо заполнить «Тип документа».",
    "Необходимо заполнить «Номер».",
    "Необходимо заполнить «Кем выдан».",
    "Необходимо заполнить «Дата выдачи».",
  };

  public static final String[] STEP_3_HINTS = {
    "Необходимо заполнить «Документ об образовании».",
    "Необходимо заполнить «Кем выдан».",
    "Необходимо заполнить «Номер».",
    "Необходимо заполнить «Дата выдачи».",
    "Необходимо заполнить «Отлично (кол-во)».",
    "Необходимо заполнить «Удовл. (кол-во)».",
    "Необходимо заполнить «Хорошо (кол-во)».",
  };

  public static final String[] STEP_4_HINTS = {
    "Необходимо заполнить «Наименование организации».",
    "Необходимо заполнить «Уровень базового образования».",
  };

  public static final String[] STEP_5_HINTS = {
    "Необходимо заполнить «Код и наименование специальности/профессии»."
  };

  public static final String[] STEP_6_HINTS = {
    "Необходимо заполнить «Оценка»."
  };

  public static final String[] STEP_7_HINTS = {
    "Необходимо заполнить «Номер».",
    "Необходимо заполнить «Группа инвалидности».",
    "Необходимо заполнить «Причина».",
    "Необходимо заполнить «Дата выдачи»."
  };

  public static final String[] STEP_8_HINTS = {
    "Необходимо заполнить «ФИО».",
    "Необходимо заполнить «Телефон»."
  };
}